<a href="https://colab.research.google.com/github/dianakang/DIANA_GIT/blob/master/pandas_dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 데이터프레임 생성하기

In [1]:
import pandas as pd

판다스 데이터프레임을 생성하는 방법은 크게 1. 딕셔너리 사용, 2. 리스트 사용 두 가지로 나뉜다.

## 1. 딕셔너리 사용

In [2]:
# 딕셔너리를 갖고있는 리스트 생성
friend_dict_list = [
    {'name':'John', 'age': 25, 'job': 'student'},
    {'name':'Nate', 'age': 30, 'job': 'teacher'}
]

In [3]:
# 데이터프레임 생성
df = pd.DataFrame(friend_dict_list)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

but, 딕셔너리의 경우에는 key의 값 순서가 보장되어 있지 않음.
해결방법은 크게 2가지로 나뉜다.

In [4]:
# 1. 원하는 컬럼 순서대로 지정
df = df[['name','age','job']]
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [5]:
# 2. 파이썬에서 지원하는 OrderedDictionary이용하여 데이터프레임 생성 -> 키의 순서 보장.
from collections import OrderedDict
friend_ordered_dict = OrderedDict(
    [
        ('name', ['John', 'Nate']),
        ('age', [25, 30]),
        ('job', ['student', 'teacher'])
    ]
)

df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

## 2. 리스트 사용

### 2.1. 첫번째 방법

컬럼 헤더를 이용하는 방법

In [6]:
# 리스트 생성
friend_list = [
    ['John', 20, 'student'],
    ['Nate', 30, 'teacher']
]

In [7]:
# 컬럼 헤더 생성
column_name = ['name','age','job']

In [8]:
# 데이터프레임 생성
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

### 2.2. 두번째 방법

컬럼 헤더를 이용하지 않고 한 번에 만드는 방법

In [12]:
# 리스트 생성 - 이중리스트
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20,30]],
    ['job', ['student','teacher']]
]

강의에서 언급해주신 pd.DataFrame.from_items는 버전 0.23.0부터는 더 이상 사용되지 않는다. 

따라서 pd.DataFrame.from_items(friend_list)대신 아래와 같이 코드를 수정해야한다.

In [14]:
# 데이터프레임 생성
import collections
df = pd.DataFrame.from_dict(collections.OrderedDict(friend_list))
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher